Revit 2026 API

# AreaLoadGetRefPoint Method

---

Returns the physical location of the reference point.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetRefPoint(
	int index
)
```
```vb
Public Function GetRefPoint (
	index As Integer
) As XYZ
```
```cpp
public:
XYZ^ GetRefPoint(
	int index
)
```
```fsharp
member GetRefPoint :
        index : int -> XYZ
```

#### Parameters

index Int32
     The index of the point to return.

#### Return Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when index is out of range. |

The index should be between 0 and less than NumRefPoints.

#### Reference

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace